sdaiGetUpperIndex(Sdai_Id_aggr*)
\details
Retrieves the upper index for a specified array.
\param sdaiArray [in] An array.
\returns An SDAI integer value that contains the upper value of the array index.
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiTR_NAVL - Transaction currently not available.
* sdaiTR_EAB - Transaction ended abnormally.
* sdaiRP_NOPN - Repository is not open.
* sdaiMX_NDEF - SDAI-model access not defined.
* sdaiAI_NEXS - Aggregate instance does not exist.
* sdaiAI_NVLD - Aggregate instance invalid.
* sdaiFN_NAVL - Function not available.
* sdaiSY_ERR - Underlying system error.
\code
SdaiAppInstance arrayInstance = sdaiCreateInstanceBN(sdaiModel, "testarrayinstance");
SdaiArray intArray = sdaiCreateAggrBN(arrayInstance, "IntArray");
sdaiGetLowerIndex(intArray); // == -2
sdaiGetUpperIndex(intArray); // == 5
sdaiResetArrayIndex(intArray, -4, 3);
sdaiGetLowerIndex(intArray); // == -4
sdaiGetUpperIndex(intArray); // == 3